{
    "_meta": {
        "sources": [{
            "json": "RBMM",
            "abbreviation": "RBMM",
            "full": "Rici's Book of Magical Magic",
            "authors": [
                "Ricij"
            ],
            "convertedBy": [
                "Gabij"
            ],
            "version": "1.0",
            "url": "www.google.com",
            "targetSchema": "1.0"
        }],
        "dateAdded": 1663497984,
        "dateLastModified": 1663497984
    },
    "feat": [{
            "name": "Aberrant Dragonmark",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                    "source": "UAWGE",
                    "page": 112
                },
                {
                    "source": "ERLW",
                    "page": 52
                }
            ],
            "prerequisite": [{
                "other": "No other dragonmark"
            }],
            "additionalSpells": [{
                "ability": "con",
                "innate": {
                    "_": {
                        "rest": {
                            "1": [{
                                "choose": "level=1|class=Sorcerer"
                            }]
                        }
                    }
                },
                "known": {
                    "_": [{
                        "choose": "level=0|class=Sorcerer"
                    }]
                }
            }],
            "entries": [
                "You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn a {@filter cantrip of your choice from the sorcerer spell list|spells|level=0|class=Sorcerer}. In addition, choose a {@filter 1st-level spell from the sorcerer spell list|spells|level=1|class=Sorcerer}. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.",
                        "When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage."
                    ]
                },
                "You also develop a random flaw from the Aberrant Dragonmark Flaws table.",
                {
                    "type": "table",
                    "caption": "Aberrant Dragonmark Flaws",
                    "colLabels": [
                        "d8",
                        "Flaw"
                    ],
                    "colStyles": [
                        "col-2 text-center",
                        "col-10"
                    ],
                    "rows": [
                        [
                            "1",
                            "Your mark is a source of constant physical pain."
                        ],
                        [
                            "2",
                            "Your mark whispers to you. Its meaning can be unclear."
                        ],
                        [
                            "3",
                            "When you're stressed, the mark hisses audibly."
                        ],
                        [
                            "4",
                            "The skin around the mark is burned, scaly, or withered."
                        ],
                        [
                            "5",
                            "Animals are uneasy around you."
                        ],
                        [
                            "6",
                            "You have a mood swing any time you use your mark."
                        ],
                        [
                            "7",
                            "Your looks change slightly whenever you use the mark."
                        ],
                        [
                            "8",
                            "You have horrific nightmares after you use your mark."
                        ]
                    ]
                }
            ]
        },
        {
            "name": "Actor",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "entries": [
                "Skilled at mimicry and dramatics, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on Charisma ({@skill Deception}) and Charisma ({@skill Performance}) checks when trying to pass yourself off as a different person.",
                        "You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom ({@skill Insight}) check contested by your Charisma ({@skill Deception}) check allows a listener to determine that the effect is faked.",
                        "When you hear someone speak, you can, with a successful Wisdom ({@skill Insight}) check, determine is the language spoken their native language."
                    ]
                }
            ]
        },
        {
            "name": "Alert",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "entries": [
                "Always on the lookout for danger, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain a +5 bonus to initiative.",
                        "You can't be surprised while you are conscious.",
                        "Other creatures don't gain advantage on attack rolls against you as a result of being unseen by you."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Acolyte",
            "source": "RBMM",
            "page": 0,
            "additionalSpells": [{
                "ability": {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    }
                },
                "innate": {
                    "_": {
                        "will": [
                            "detect magic"
                        ],
                        "daily": {
                            "1e": [
                                "identify",
                                "dispel magic"
                            ]
                        }
                    }
                }
            }],
            "entries": [
                "You learn more of the magic arcane scholars focus on. You learn the {@spell detect magic} spell and can cast it up to your proficiency bonus number of times, without expending a spell slot. You also learn {@spell identify} and {@spell dispel magic}, each of which you can cast once without expending a spell slot. You regain the ability to cast those spells in this way when you finish a long rest. Chose the casting stat for those spells from Intelligence, Wisdom and Charisma."
            ]
        },
        {
            "name": "Artificer Initiate",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "TCE",
                "page": 79
            }],
            "toolProficiencies": [{
                "anyArtisansTool": true
            }],
            "additionalSpells": [{
                "ability": {
                    "choose": {
                        "from": [
                            "int",
                            "cha"
                        ]
                    }
                },
                "innate": {
                    "_": {
                        "daily": {
                            "1": [{
                                "choose": "level=1|class=Artificer"
                            }]
                        }
                    }
                },
                "known": {
                    "_": [{
                        "choose": "level=0|class=Artificer"
                    }]
                }
            }],
            "entries": [
                "You've learned some of an artificer's inventiveness:",
                {
                    "type": "list",
                    "items": [
                        "You learn one cantrip of your choice from the {@filter artificer spell list|spells|level=0;1|class=artificer}, and you learn one 1st-level spell of your choice from {@filter that list|spells|level=0;1|class=artificer}. Intelligence or Charisma is your spellcasting ability for these spells.",
                        "You can cast this feat's 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.",
                        "You gain proficiency with one type of {@filter artisan's tools|items|type=artisan's tools} of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses the chosen ability score as its spellcasting ability."
                    ]
                }
            ]
        },
        {
            "name": "Athlete",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "entries": [
                "You have undergone extensive physical training to gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you are {@condition prone}, standing up uses only 5 feet of your movement.",
                        "Climbing doesn't cost you extra movement.",
                        "You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet.",
                        "When making an {@skill Acrobatics} check, you may use Strength as a base stat."
                    ]
                }
            ]
        },
        {
            "name": "Bountiful Luck",
            "source": "RBMM",
            "page": 73,
            "prerequisite": [{
                "race": [{
                    "name": "halfling"
                }]
            }],
            "entries": [
                "Your people have extraordinary luck, which you have learned to mystically lend to your companions when you see them falter. You're not sure how you do it; you just wish it, and it happens. Surely a sign of fortune's favor!",
                "When an ally you can see within 20 feet of you rolls a 1 on the {@dice d20} for an attack roll, an ability check, or a saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll.",
                "When you use this ability, you can't use your Lucky racial trait before the end of your next turn."
            ]
        },
        {
            "name": "Charger",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "entries": [
                "When you use your action to {@action Dash}, you can use a bonus action to make one melee weapon attack or to {@action shove} a creature.",
                "If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack's damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed)."
            ]
        },
        {
            "name": "Chef",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "other": "Proficiency with {@item cook's utensils|phb}"
            }],
            "entries": [
                "Time and effort spent mastering the culinary arts has paid off. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When using the ability to cook food provided by your {@item cook's utensils|phb} proficiency, all creatures that eat the food heal for an additional {@dice 1d8} and may maximize their first hit die spent on healing this short rest.",
                        "With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to your proficiency bonus as well as advantage on the first saving throw made within 1 minute of consuming the treat."
                    ]
                }
            ]
        },

        {
            "name": "Crossbow Expert",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "entries": [
                "Thanks to extensive practice with the crossbow, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You ignore the loading quality of crossbows with which you are proficient.",
                        "Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls with ranged weapons.",
                        "When you use the {@action Attack} action and attack with a one-handed weapon, you can use a bonus action to attack with a {@item hand crossbow|phb} you are holding."
                    ]
                }
            ]
        },

        {
            "name": "Crusher",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "TCE",
                "page": 79
            }],
            "entries": [
                "You are practiced in the art of crushing your enemies, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.",
                        "When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the start of your next turn.",
                        "Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can forgo dealing damage and instead knock the target prone, provided the target is no more than one size larger than you."
                    ]
                }
            ]
        },

        {
            "name": "Defensive Duelist",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "prerequisite": [{
                "ability": [{
                    "dex": 13
                }]
            }],
            "entries": [
                "When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you."
            ]
        },
        {
            "name": "Dragon Fear",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "XGE",
                "page": 74
            }],
            "prerequisite": [{
                "other": "Breath Weapon"
            }],
            "ability": [{
                "choose": {
                    "from": [
                        "str",
                        "con",
                        "cha"
                    ],
                    "amount": 1
                }
            }],
            "entries": [
                "When angered, you radiate menace. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Instead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 30 feet of you to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Charisma modifier). A target automatically succeeds on the save if it can't hear or see you. On a failed save, a target becomes {@condition frightened} of you for 1 minute. If the {@condition frightened} target takes any damage, it can repeat the saving throw, ending the effect on itself on a success."
                    ]
                }
            ]
        },
        {
            "name": "Dragon Hide",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "XGE",
                    "page": 74
                }
            ],
            "prerequisite": [
                {
                    "other": "Draconic origin"
                }
            ],
            "entries": [
                "You manifest scales and claws reminiscent of your draconic ancestors. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your scales harden. While you aren't wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a shield and still gain this benefit.",
                        "You grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to {@dice 1d4} + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike.",
                        "When zou reach level 11, the damage of your claws is increased to 1d6 + your Strength modifier."
                    ]
                }
            ]
        },
        {
            "name": "Dual Wielder",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "PHB",
                    "page": 165
                }
            ],
            "entries": [
                "You master fighting with two weapons, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.",
                        "You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light.",
                        "You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one."
                    ]
                }
            ]
        },
        {
            "name": "Dungeon Delver",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "PHB",
                    "page": 166
                }
            ],
            "entries": [
                "Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on Wisdom ({@skill Perception}) checks made to detect the presence of secret doors and traps.",
                        "You have advantage on saving throws made to avoid or resist traps.",
                        "You have resistance to the damage dealt by traps.",
                        "Traveling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom ({@skill Perception}) score."
                    ]
                }
            ]
        },
        {
            "name": "Durable",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "PHB",
                    "page": 166
                }
            ],
            "entries": [
                "Hardy and resilient, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).",
                        "When you fall to 0 hit points, you immediately gain 1 successful death save."
                    ]
                }
            ]
        },
        {
            "name": "Eldritch Adept",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "TCE",
                    "page": 79
                }
            ],
            "prerequisite": [
                {
                    "spellcasting2020": true
                }
            ],
            "optionalfeatureProgression": [
                {
                    "name": "Eldritch Invocations",
                    "featureType": [
                        "EI"
                    ],
                    "progression": {
                        "*": 1
                    }
                }
            ],
            "entries": [
                "Studying occult lore, you learn one {@filter Eldritch Invocation|optionalfeatures|Feature Type=EI} option of your choice from the warlock class. Your spellcasting ability for the invocation is Intelligence, Wisdom, or Charisma (choose when you select this feat). If the invocation has a prerequisite of any kind, you can choose that invocation only if you're a warlock who meets the prerequisite.",
                "Whenever you gain a level, you can replace the invocation with another one from the warlock class."
            ]
        },
        {
            "name": "Elemental Adept",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "PHB",
                    "page": 166
                }
            ],
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "entries": [
                "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.",
                "Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.",
                "You can select this feat multiple times. Each time you do so, you must choose a different damage type."
            ]
        },
        {
            "name": "Fey Teleportation",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "XGE",
                    "page": 74
                }
            ],
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf",
                            "subrace": "high"
                        }
                    ]
                }
            ],
            "languageProficiencies": [
                {
                    "sylvan": true
                }
            ],
            "additionalSpells": [
                {
                    "ability": "inherit",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "misty step"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "Your study of druidic lore has unlocked fey power that few others possess. Drawing on your fey knowlede, you can momentarily stride through the Feywild to shorten your path from one place to another. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn to speak, read, and write {@language Sylvan}.",
                        "You learn the {@spell misty step} spell and can cast it once without expending a spell slot. You regain the ability to cast it in this way when you finish a short or long rest."
                    ]
                }
            ]
        },
        {
            "name": "Fey Touched",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "TCE",
                    "page": 79
                }
            ],
            "additionalSpells": [
                {
                    "ability": {
                        "choose": 
                        {
                            "from": [
                                "int",
                                "wis",
                                "cha"
                            ]
                        }
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1e": [
                                    "misty step",
                                    {
                                        "choose": "level=1|school=E;D"
                                    }
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "Your exposure to the Feywild's magic has changed you, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn the {@spell misty step} spell and one {@filter 1st-level spell|spells|level=1|school=E;D} of your choice. The {@filter 1st-level spell|spells|level=1|school=E;D} must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is Intelligence, Wisdom, or Charisma, chosen when you take this feat."
                    ]
                }
            ]
        },
        {
            "name": "Fighting Initiate",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "TCE",
                    "page": 80
                }
            ],
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "weapon": "martial"
                        }
                    ]
                }
            ],
            "optionalfeatureProgression": [
                {
                    "name": "Fighting Style",
                    "featureType": [
                        "FS:F"
                    ],
                    "progression": {
                        "*": 1
                    }
                }
            ],
            "entries": [
                "Your martial training has helped you develop a particular style of fighting. As a result, you learn one {@filter Fighting Style|optionalfeatures|Feature Type=FS:F} option of your choice from the fighter class. If you already have a style, the one you choose must be different.",
                "Whenever you reach a level that grants the Ability Score Improvement feature, you can replace this feat's fighting style with another one from the fighter class that you don't have."
            ]
        },
        {
            "name": "Favored by Flames",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You learn to call on hellfire to serve your commands. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you roll fire damage for a spell you cast, you can reroll any roll of 1 on the fire damage dice, but you must use the new roll, even if it is another 1.",
                        "Whenever you cast a spell that deals fire damage, you can cause flames to wreathe you until the end of your next turn. The flames don't harm you or your possessions, and they shed bright light out to 30 feet and dim light for an additional 30 feet. While the flames are present, any creature within 5 feet of you that hits you with a melee attack takes {@damage 1d4} fire damage."
                    ]
                }
            ]
        },
        {
            "name": "Grappler",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "PHB",
                    "page": 167
                }
            ],
            "srd": true,
            "entries": [
                "You've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on attack rolls against a creature you are grappling.",
                        "You can use your action to try to restrain a creature {@condition grappled} by you. To do so, make another grapple check. If you succeed, you and the creature are both {@condition restrained} until the grapple ends.",
                        "You can use your action to try to pin a creature restrained by you. To do so, make another grapple check. If you succeed, you are no longer {@condition restrained}."
                    ]
                }
            ]
        },
        {
            "name": "Great Weapon Master",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "entries": [
                "You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.",
                        "Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage."
                    ]
                }
            ]
        },
        {
            "name": "Gunner",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"TCE",
                    "page": 80
                }
            ],
            "weaponProficiencies": [
                {
                    "firearms": true
                }
            ],
            "entries": [
                "You have a quick hand and keen eye when employing firearms, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with firearms (see \"{@variantrule Firearms|DMG}\" in the Dungeon Master's Guide).",
                        "Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged weapon attack rolls."
                    ]
                }
            ]
        },
        {
            "name": "Trained Healer",
            "source": "RBMM",
            "page": 0,
            "prerequisite":[
                {
                    "other": "Proficiency in the {@skill Medicine} skill"
                }
            ],
            "entries": [
                "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you use a {@item healer's kit|phb} to stabilize a dying creature, that creature also regains 1 hit point.",
                        "As an action, you can spend one use of a {@item healer's kit|phb} to tend to a creature and restore {@dice 1d6 + 4} hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice. The creature can't regain hit points from this feat again until it finishes a short or long rest.",
                        "You may use Intelligence instead of Wisdom when using the {@skill Medicine} skill."
                    ]
                }
            ]
        },
        {
            "name": "Heavily Armored",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "armor": "medium"
                        }
                    ]
                }
            ],
            "armorProficiencies": [
                {
                    "heavy": true
                }
            ],
            "entries": [
                "You have trained to master the use of heavy armor, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with heavy armor.",
                        "You reduce the strength requirement for wearing heavy armor by 2.",
                        "While wearing heavy armor, you ignore all instances of physical damage from attacks that would deal less than 3 damage to you"
                    ]
                }
            ]
        },
        {
            "name": "Heavy Armor Master",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "armor": "heavy"
                        }
                    ]
                }
            ],
            "entries": [
                "You can use your armor to deflect strikes that would kill others. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from nonmagical attacks is reduced by 3.",
                        "Instead of {@skill Stealth} check disadvantage give by wearing heavy armor, you have -2 to Stealth checks."
                    ]
                }
            ]
        },
        {
            "name": "Inspiring Leader",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "prerequisite": [
                {
                    "ability": [
                        {
                            "cha": 13
                        }
                    ]
                }
            ],
            "entries": [
                "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points from this feat again until it has finished a short or long rest."
            ]
        },
        {
            "name": "Immunological Adaptation",
            "source": "RBMM",
            "page": 0,
            "ability": [
                {
                    "con": 1
                }
            ],
            "entries": [
                "A special type of blood runs strong in you, unlocking a resilience akin to that possessed by some fiends. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have resistance to poison damage.",
                        "You have advantage on saving throws against being {@condition poisoned} and on saving throws to overcome disease.",
                        "After recieving poison damage, until the end of zour next turn, your natural weapons that deal slashing or piercing damage (such as claws, bites, etc.) deal and additional 1d4 poison damage."
                    ]
                }
            ]
        },
        {
            "name": "Keen Mind",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "entries": [
                "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You always know which way is north.",
                        "You always know the number of hours left before the next sunrise or sunset.",
                        "You can accurately recall anything you have seen or heard within the past month.",
                        "You have 2 additional spells prepared or, if your class doesn't have prepared spells, you have 1 additional spell known."
                    ]
                }
            ]
        },
        {
            "name": "Lightly Armored",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "armorProficiencies": [
                {
                    "light": true
                }
            ],
            "entries": [
                "You have trained to master the use of light armor, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with light armor.",
                        "Donnig and doffing armor takes half the usual time."
                    ]
                }
            ]
        },
        {
            "name": "Linguist",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "languageProficiencies": [
                {
                    "any": 3
                }
            ],
            "entries": [
                "You have studied languages and codes, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn three languages of your choice.",
                        "You can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it."
                    ]
                }
            ]
        },
        {
            "name": "Lucky",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 167
                }
            ],
            "entries": [
                "You have inexplicable luck that seems to kick in at just the right moment.",
                "You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, before you roll, you can spend one luck point to roll an additional {@dice d20}. You choose which of the {@dice d20}s is used for the attack roll, ability check, or saving throw.",
                "You can also spend one luck point when an attack roll is made against you, but before the die is rolled. Roll a {@dice d20}, and then choose whether the attack uses the attacker's roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.",
                "You regain your expended luck points when you finish a long rest."
            ]
        },
        {
            "name": "Mage Slayer",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "entries": [
                "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.",
                        "When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.",
                        "You have advantage on saving throws against spells cast by creatures within 5 feet of you."
                    ]
                }
            ]
        },
        {
            "name": "Magic Initiate",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "additionalSpells": [
                {
                    "name": "Bard Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Bard"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Bard",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Cleric Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Cleric"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Cleric",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Druid Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Druid"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Druid",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Sorcerer Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Sorcerer"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Sorcerer",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Warlock Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Warlock"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Warlock",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Wizard Spells",
                    "ability": "int",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Wizard"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Wizard",
                                "count": 2
                            }
                        ]
                    }
                }
            ],
            "entries": [
                "Choose a class: {@filter bard|spells|level=0;1|class=bard}, {@filter cleric|spells|level=0;1|class=cleric}, {@filter druid|spells|level=0;1|class=druid}, {@filter sorcerer|spells|level=0;1|class=sorcerer}, {@filter warlock|spells|level=0;1|class=warlock}, or {@filter wizard|spells|level=0;1|class=wizard}. You learn two cantrips of your choice from that class's spell list.",
                "In addition, choose one 1st-level spell to learn from that same list. Using this feat, you can cast the spell once at its lowest level, and you must finish a long rest before you can cast it in this way again.",
                "Your spellcasting ability for these spells depends on the class you chose: Charisma for {@filter bard|spells|level=0;1|class=bard}; Charisma or Wisdom for {@filter sorcerer|spells|level=0;1|class=sorcerer}; Charisma or Intelligence for {@filter warlock|spells|level=0;1|class=warlock}; Wisdom, Intelligence or Charisma for {@filter cleric|spells|level=0;1|class=cleric}; Wisdom or Charisma for {@filter druid|spells|level=0;1|class=druid}; or Intelligence or Wisdom for {@filter wizard|spells|level=0;1|class=wizard}."
            ]
        },
        {
            "name": "Martial Adept",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "optionalfeatureProgression": [
                {
                    "name": "Maneuvers",
                    "featureType": [
                        "MV:B"
                    ],
                    "progression": {
                        "*": 2
                    }
                }
            ],
            "entries": [
                "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn two {@filter maneuvers|optionalfeatures|feature type=MV:B} of your choice from among those available to the {@class fighter|phb|Battle Master|Battle Master|phb|2-0} archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).",
                        "You gain one superiority die, which is a {@dice d6} (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest. This die increases in size as if your level were levels in the fighter class."
                    ]
                }
            ]
        },
        {
            "name": "Medium Armor Master",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "armor": "medium"
                        }
                    ]
                }
            ],
            "entries": [
                "You have practiced moving in medium armor to gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Wearing medium armor doesn't impose disadvantage on your Dexterity ({@skill Stealth}) checks.",
                        "When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher."
                    ]
                }
            ]
        },
        {
            "name": "Metamagic Adept",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"TCE",
                    "page": 80
                }
            ],
            "prerequisite": [
                {
                    "spellcasting2020": true
                }
            ],
            "optionalfeatureProgression": [
                {
                    "name": "Metamagic",
                    "featureType": [
                        "MM"
                    ],
                    "progression": {
                        "*": 2
                    }
                }
            ],
            "entries": [
                "You've learned how to exert your will on your spells to alter how they function:",
                {
                    "type": "list",
                    "items": [
                        "You learn two {@filter Metamagic|optionalfeatures|Feature Type=MM} options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you reach a level that grants the Ability Score Improvement feature, you can replace one of these Metamagic options with another one from the sorcerer class.",
                        "You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest.",
                        "You gain 1 additional sorcerer point when you reach level 11."
                    ]
                }
            ]
        },
        {
            "name": "Mobile",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "entries": [
                "You are exceptionally speedy and agile. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your speed increases by 10 feet.",
                        "When you use the {@action Dash} action, {@quickref difficult terrain||3} doesn't cost you extra movement on that turn.",
                        "When you make a melee attack against a creature, you don't provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not."
                    ]
                }
            ]
        },
        {
            "name": "Moderately Armored",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "armor": "light"
                        }
                    ]
                }
            ],
            "armorProficiencies": [
                {
                    "medium": true,
                    "shield|phb": true
                }
            ],
            "entries": [
                "You have trained to master the use of medium armor and shields, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with medium armor and shields.",
                        "Donning and doffing a shield is a free action.",
                        "When taking a long rest in armor, you roll the Constitution save for sleeping in armor with advantage."
                    ]
                }
            ]
        },
        {
            "name": "Mounted Combatant",
            "source": "RBMM",
            "page": 0,
            "otherSources": [
                {
                    "source":"PHB",
                    "page": 168
                }
            ],
            "entries": [
                "You are a dangerous foe to face while mounted. While you are mounted and aren't {@condition incapacitated}, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.",
                        "You can force an attack targeted at your mount to target you instead.",
                        "If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
                    ]
                }
            ]
        },
        {
            "name": "Observant",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"PHB",
                    "page":168
                }
            ],
            "entries": [
                "Quick to notice details of your environment, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "If you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips.",
                        "You have a +3 bonus to your ({@skill Perception}) score."
                    ]
                }
            ]
        },
        {
            "name": "Savage Fury",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"XGE",
                    "page": 75
                }
            ],
            "entries": [
                "Your fury burns tirelessly. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you hit with an attack using a {@filter simple or martial weapon|items|source=phb|category=basic|type=martial weapon;simple weapon}, you can roll one of the weapon's damage dice an additional time and add it as extra damage of the weapon's damage type. Once you use this ability, you can't use it again until you finish a short or long rest.",
                        "During the first round of combat, your melee attacks deal additional damage equal to your proficiency bonus."
                    ]
                }
            ]
        },
        {
            "name": "Piercer",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"TCE",
                    "page": 80
                }
            ],
            "entries": [
                "You have achieved a penetrating precision in combat, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.",
                        "When you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes."
                    ]
                }
            ]
        },
        {
            "name": "Poisoner",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"TCE",
                    "page":80
                }
            ],
            "toolProficiencies": [
                {
                    "poisoner's kit": true
                }
            ],
            "entries": [
                "You can prepare and deliver deadly poisons, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you make a damage roll that deals poison damage, it ignores resistance to poison damage.",
                        "You can apply poison to a weapon or piece of ammunition as a bonus action, instead of an action.",
                        "You gain proficiency with the {@item poisoner's kit|phb} if you don't already have it. With one hour of work using a {@item poisoner's kit|phb} and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution saving throw or take {@damage 2d8} poison damage and become {@condition poisoned} until the end of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Polearm Master",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"PHB",
                    "page":168
                }
            ],
            "entries": [
                "You can keep your enemies at bay with reach weapons. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you take the {@action Attack} action and attack with only a {@item glaive|phb}, {@item halberd|phb}, {@item quarterstaff|phb}, or {@item spear|phb}, you can use a bonus action to make a melee attack with the opposite end of the weapon; this attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a {@dice d4}, and the attack deals bludgeoning damage.",
                        "While you are wielding a {@item glaive|phb}, {@item halberd|phb}, {@item pike|phb}, {@item quarterstaff|phb}, or {@item spear|phb}, other creatures provoke an opportunity attack from you when they enter the reach you have with that weapon."
                    ]
                }
            ]
        },
        {
            "name": "Prodigy",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source": "XGE",
                    "page": 75
                }
            ],
            "skillProficiencies": [
                {
                    "choose": {
                        "from": [
                            "athletics",
                            "acrobatics",
                            "sleight of hand",
                            "stealth",
                            "arcana",
                            "history",
                            "investigation",
                            "nature",
                            "religion",
                            "animal handling",
                            "insight",
                            "medicine",
                            "perception",
                            "survival",
                            "deception",
                            "intimidation",
                            "performance",
                            "persuasion"
                        ]
                    }
                }
            ],
            "languageProficiencies": [
                {
                    "any": 1
                }
            ],
            "toolProficiencies": [
                {
                    "any": 1
                }
            ],
            "entries": [
                "You have a knack for learning new things. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain one {@table skills|phb|skill proficiency} of your choice, one {@filter tool proficiency|items|type=tool;artisan's tools} of your choice, and fluency in one language of your choice."
                        ]
                }
            ]
        },
        {
            "name": "Powder Monkey",
            "source":"RBMM",
            "page":0,
            "entries":[
                {
                    "type": "list",
                    "items":[
                        "You ignore the loading property of firearms.",
                        "When you use the Attack action and attack with a one handed weapon, you can use a bonus action to attack with a one handed firearm you are holding."
                    ]
                }
            ]
        },
        {
            "name": "Quick Recovery",
            "source": "RBMM",
            "page": 0,
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Whenever you take the {@action Dodge} action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1).",
                        "When finishing a long rest, you recover 1 additional hit die for every 5 levels (minimum of 1)."
                    ]
                }
            ]
        },
        {
            "name": "Resilient",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"PHB",
                    "page":168
                }
            ],
            "entries": [
                "Choose one ability score. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency in saving throws using the chosen ability.",
                        "You gain proficiency in death saving throws."
                    ]
                }
            ]
        },
        {
            "name": "Ritual Caster",
            "source": "RBMM",
            "page": 0,
            "otherSources":[
                {
                    "source":"PHB",
                    "page":169
                }
            ],
            "prerequisite": [
                {
                    "ability": [
                        {
                            "int": 13
                        },
                        {
                            "wis": 13
                        },
                        {
                            "cha": 13
                        }
                    ]
                }
            ],
            "additionalSpells": [
                {
                    "name": "Bard Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Bard|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Cleric Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Cleric|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Druid Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Druid|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Sorcerer Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Sorcerer|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Warlock Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Warlock|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Wizard Spells",
                    "ability": "int",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Wizard|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.",
                "When you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: {@filter bard|spells|level=1|class=bard|components & miscellaneous=ritual}, {@filter cleric|spells|level=1|class=cleric|components & miscellaneous=ritual}, {@filter druid|spells|level=1|class=druid|components & miscellaneous=ritual}, {@filter sorcerer|spells|level=1|class=sorcerer|components & miscellaneous=ritual}, {@filter warlock|spells|level=1|class=warlock|components & miscellaneous=ritual}, or {@filter wizard|spells|level=1|class=wizard|components & miscellaneous=ritual}. You must choose your spells from that class's spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells (see Class primary stats table).",
                "If you come across a spell in written form, such as a magical {@item spell scroll} or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it."
            ]
        },
        {
            "name": "Second Chance",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "Fortune favors you when someone tries to strike you. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When a creature you can see hits you with an attack roll, you can use your reaction to force that creature to reroll. Once you use this ability, you can't use it again until you roll initiative at the start of combat or until you finish a short or long rest."
                    ]
                }
            ]
        },

        {
            "name": "Sentinel",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn.",
                        "Creatures provoke opportunity attacks from you even if they take the {@action Disengage} action before leaving your reach.",
                        "When a creature within 5 feet of you makes an attack against a target other than you (and that target doesn't have this feat), you can use your reaction to make a melee weapon attack against the attacking creature."
                    ]
                }
            ]
        },

        {
            "name": "Shadow Touched",
            "source": "RBMM",
            "page": 0,

            "additionalSpells": [{
                "ability": "inherit",
                "innate": {
                    "_": {
                        "daily": {
                            "1e": [
                                "invisibility",
                                {
                                    "choose": "level=1|school=I;N"
                                }
                            ]
                        }
                    }
                }
            }],
            "entries": [
                "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn the {@spell invisibility} spell and one {@filter 1st-level spell|spells|level=1|school=I;N} of your choice. The {@filter 1st-level spell|spells|level=1|school=I;N} must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level.  The spells' spellcasting ability is Intelligence, Wisdom, or Charisma."
                    ]
                }
            ]
        },

        {
            "name": "Sharpshooter",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your ranged weapon attacks treat three quarters cover as half cover.",
                        "Your ranged weapon attacks ignore half cover and three-quarters cover.",
                        "When making a called shot, may take a -5 penalty to hit instead of disadvantage"
                    ]
                }
            ]
        },

        {
            "name": "Farshot",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You manage to get more out of your ranged weapons than others can. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.",
                        "Your ranged weapon attacks ignore half cover"

                    ]
                }
            ]
        },

        {
            "name": "Shield Master",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a {@item shield|phb}:",
                {
                    "type": "list",
                    "items": [
                        "If you take the {@action Attack} action on your turn, you can use a bonus action to try to {@action shove} a creature within 5 feet of you with your shield.",
                        "If you aren't {@condition incapacitated}, you can add your shield's AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.",
                        "If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect."
                    ]
                }
            ]
        },

        {
            "name": "Skill Expert",
            "source": "RBMM",
            "page": 0,
            "skillProficiencies": [{
                "choose": {
                    "from": [
                        "athletics",
                        "acrobatics",
                        "sleight of hand",
                        "stealth",
                        "arcana",
                        "history",
                        "investigation",
                        "nature",
                        "religion",
                        "animal handling",
                        "insight",
                        "medicine",
                        "perception",
                        "survival",
                        "deception",
                        "intimidation",
                        "performance",
                        "persuasion"
                    ]
                }
            }],
            "expertise": [{
                "anyProficientSkill": 1
            }],
            "entries": [
                "You have honed your proficiency with particular skills, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency in one {@table skills|phb|skill} of your choice.",
                        "Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus."
                    ]
                }
            ]
        },

        {
            "name": "Skilled",
            "source": "RBMM",
            "page": 0,
            "skillToolLanguageProficiencies": [{
                "choose": [{
                    "from": [
                        "anySkill",
                        "anyTool"
                    ],
                    "count": 3
                }]
            }],
            "entries": [
                "You gain proficiency in any combination of three {@table skills|phb} or {@filter tools|items|type=tools;artisan's tools;instrument;gaming set;vehicle (land);vehicle (water)} of your choice."
            ]
        },

        {
            "name": "Skulker",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "ability": [{
                    "dex": 13
                }]
            }],
            "entries": [
                "You are expert at slinking through shadows. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can try to hide when you are lightly obscured from the creature from which you are hiding.",
                        "When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.",
                        "Dim light doesn't impose disadvantage on your Wisdom ({@skill Perception}) checks relying on sight."
                    ]
                }
            ]
        },
        {
            "name": "Slasher",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You've learned where to cut to have the greatest results, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Once per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.",
                        "When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls."
                    ]
                }
            ]
        },

        {
            "name": "Spell Sniper",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "spellcasting": true
            }],

            "entries": [
                "You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you cast a spell that requires you to make an attack roll, the spell's range is doubled.",
                        "Your ranged spell attacks ignore half cover and three-quarters cover."
                    ]
                }
            ]
        },

        {
            "name": "Squat Nimbleness",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "race": [{
                        "name": "dwarf"
                    },
                    {
                        "name": "small race",
                        "displayEntry": "a Small race"
                    }
                ]
            }],
            "skillProficiencies": [{
                "choose": {
                    "from": [
                        "acrobatics",
                        "athletics"
                    ]
                }
            }],
            "entries": [
                "You are uncommonly nimble for your race. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Increase your walking speed by 5 feet.",
                        "You gain proficiency in the {@skill Acrobatics} or {@skill Athletics} skill (your choice).",
                        "You have advantage on any Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check you make to escape from being {@condition grappled}."
                    ]
                }
            ]
        },

        {
            "name": "Strixhaven Initiate",
            "source": "RBMM",
            "page": 0,
            "additionalSpells": [{
                    "name": "Lorehold 1",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "light#c",
                            "sacred flame#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=cleric;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Lorehold 2",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "light#c",
                            "thaumaturgy#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=cleric;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Lorehold 3",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "sacred flame#c",
                            "thaumaturgy#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=cleric;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Prismari 1",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "fire bolt#c",
                            "prestidigitation#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=bard;sorcerer"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Prismari 2",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "fire bolt#c",
                            "ray of frost#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=bard;sorcerer"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Prismari 3",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "prestidigitation#c",
                            "ray of frost#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=bard;sorcerer"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Quandrix 1",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "druidcraft#c",
                            "guidance#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=druid;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Quandrix 2",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "druidcraft#c",
                            "mage hand#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=druid;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Quandrix 3",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "guidance#c",
                            "mage hand#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=druid;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Silverquill 1",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "sacred flame#c",
                            "thaumaturgy#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=bard;cleric"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Silverquill 2",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "sacred flame#c",
                            "vicious mockery#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=bard;cleric"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Silverquill 3",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "thaumaturgy#c",
                            "vicious mockery#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=bard;cleric"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Witherbloom 1",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "chill touch#c",
                            "druidcraft#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=druid;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Witherbloom 2",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "chill touch#c",
                            "spare the dying#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=druid;wizard"
                                }]
                            }
                        }
                    }
                },
                {
                    "name": "Witherbloom 3",
                    "ability": {
                        "choose": [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": {
                        "_": [
                            "druidcraft#c",
                            "spare the dying#c"
                        ]
                    },
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [{
                                    "choose": "level=1|class=druid;wizard"
                                }]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "You have studied some magical theory and have learned a few spells associated with Strixhaven University.",
                "Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table.",
                "You can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.",
                "Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat).",
                {
                    "type": "table",
                    "caption": "Strixhaven Spells",
                    "colLabels": [
                        "College",
                        "Cantrips",
                        "1st-Level Spell"
                    ],
                    "colStyles": [
                        "col-2",
                        "col-5",
                        "col-5"
                    ],
                    "rows": [
                        [
                            "Lorehold",
                            "Choose two from {@spell light}, {@spell sacred flame}, and {@spell thaumaturgy}.",
                            "Choose one 1st-level {@filter cleric or wizard spell|spells|level=1|class=cleric;wizard}."
                        ],
                        [
                            "Prismari",
                            "Choose two from {@spell fire bolt}, {@spell prestidigitation}, and {@spell ray of frost}.",
                            "Choose one 1st-level {@filter bard or sorcerer spell|spells|level=1|class=bard;sorcerer}."
                        ],
                        [
                            "Quandrix",
                            "Choose two from {@spell druidcraft}, {@spell guidance}, and {@spell mage hand}.",
                            "Choose one 1st-level {@filter druid or wizard spell|spells|level=1|class=druid;wizard}."
                        ],
                        [
                            "Silverquill",
                            "Choose two from {@spell sacred flame}, {@spell thaumaturgy}, and {@spell vicious mockery}.",
                            "Choose one 1st-level {@filter bard or cleric spell|spells|level=1|class=bard;cleric}."
                        ],
                        [
                            "Witherbloom",
                            "Choose two from {@spell chill touch}, {@spell druidcraft}, and {@spell spare the dying}.",
                            "Choose one 1st-level {@filter druid or wizard spell|spells|level=1|class=druid;wizard}."
                        ]
                    ]
                }
            ]
        },

        {
            "name": "Tavern Brawler",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 170
            }],
            "entries": [
                "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You are proficient with improvised weapons.",
                        "Your unarmed strike uses a {@damage d4} for damage.",
                        "Your attacks using improvised weapons use a {@damage d6} for damage.",
                        "You treat improvised weapons as finesse weapons.",
                        "When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target."
                    ]
                }
            ]
        },
        {
            "name": "Tough",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "Your hit point maximum increases by an amount equal to three times your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 3 hit points.",
                "When rolling death saves, rolling a natural 20 immediately restores 1 hit point and rolling 1 on death counts as only 1 failure. "
            ]
        },

        {
            "name": "Telekinetic",
            "source": "RBMM",
            "page": 0,
            "additionalSpells": [{
                "known": {
                    "_": [
                        "mage hand#c"
                    ]
                }
            }],
            "entries": [
                "You learn to move things with your mind, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Chose Intelligence, Wisdom or Charisma.",
                        "You learn the {@spell mage hand} cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand {@condition invisible}. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability chosen by this feat.",
                        "As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score chosen by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save."
                    ]
                }
            ]
        },

        {
            "name": "Telepathic",
            "source": "RBMM",
            "page": 0,
            "additionalSpells": [{
                "ability": "inherit",
                "innate": {
                    "_": {
                        "daily": {
                            "1": [
                                "detect thoughts"
                            ]
                        }
                    }
                }
            }],
            "entries": [
                "You awaken the ability to mentally connect with others, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Choose Intelligence, Wisdom, or Charisma.",
                        "You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.",
                        "You can cast the {@spell detect thoughts} spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. Your spellcasting ability for the spell is the ability chosen by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them."
                    ]
                }
            ]
        },

        {
            "name": "War Caster",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "spellcasting": true
            }],
            "entries": [
                "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.",
                        "You can perform the somatic components of spells even when you have weapons or a {@item shield|phb} in one or both hands.",
                        "When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature."
                    ]
                }
            ]
        },

        {
            "name": "Weapon Master",
            "source": "RBMM",
            "page": 0,
            "weaponProficiencies": [{
                "choose": {
                    "fromFilter": "type=martial weapon;mundane weapon|miscellaneous=mundane",
                    "count": 4
                }
            }],
            "entries": [
                "You have practiced extensively with a variety of weapons, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with four weapons of your choice. Each one must be a simple or a martial weapon.",
                        "You gain proficiency with shields."
                    ]
                }
            ]
        },


        {
            "name": "Battlemage",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "spellcasting": true
            }],
            "entries": [
                "You are trained in casting spells while fighting close to an enemy. You gain the following benefits:",
                {

                    "type": "list",
                    "items": [
                        "You no longer have disadvantage due to making a ranged spell attack while adjacent to an enemy.",
                        "You may use a weapon you are wielding as a spellcasting focus."
                    ]
                }
            ]
        },

        {
            "name": "All Out Attack",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You fight with reckless abandon, caring little for your own safety. You may die one day  but that day will come sooner to your enemies.",
                {
                    "type": "list",
                    "items": [
                        "At the end of your turn you can enter a stance prepared for striking at anyone who comes near. You can subtract your proficiency bonus from your AC until the start of your next turn. When a creature within your reach hits you with a melee attack, you may use your reaction to make an attack against that creature."
                    ]
                }
            ]
        },
        {
            "name": "Bulwark",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "Standing still, feet on the ground, your defenses become impenetrable.",
                {
                    "type": "list",
                    "items": [
                        "At the start of your turn, you can reduce your speed to 0. If you do so you can use your reaction to impose disadvantage on a melee attack made against you before the start of your next turn.",
                        "When an effect causes you to move without expending your movement, you can reduce the movement by 5ft"
                    ]
                }
            ]
        },
        {
            "name": "Deadly Cunning",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "feature": [
                    "Sneak Attack"
                ]
            }],
            "entries": [
                "You are uncommonly nimble for your race. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When casting a cantrip that requires an attack roll and causes damage to a single target, or when you make an unarmed or improvised weapon attack, if you have advantage, you can add your Sneak Attack damage as if you were wielding a finesse or ranged weapon."
                    ]
                }
            ]
        },
        {
            "name": "Demolitionist",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "Destroying something is easy. Demolishing it is art",
                {
                    "type": "list",
                    "items": [
                        "You get advantge when making attacks against an object.",
                        "When making an attack against an object or construct, your attack critically strike on rolls of 19 or 20 and ignore half of the damage resistance the target has.",
                        "You have advantage on saving throws and ability check to avoid falling rubble or collapsing ground."
                    ]
                }
            ]
        },
        {
            "name": "Arena Fighter",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "Some fight to kill, some fight to survive. You fight to put on a show.",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with the {@item net}, {@item trident}, {@item flail}, {@item morningstar}, {@item scimitar}, {@item whip}, and {@item shield}",
                        "When making an attack with the {@item net}, you dont have Disadvantage from using the Net's long range.",
                        "When making a ranged attack against a target within 5ft of you, you don't get Disadvantage from attacking with an enemy in melee."
                    ]
                }
            ]
        },
        {
            "name": "Man of the Sea",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You find life at sea a second nature.",
                {
                    "type": "list",
                    "items": [
                        "You gain proficiency with the {@weapon net} and {@weapon trident}",
                        "When you make a ranged attack with the {@weapon net} or {@weapon trident} against a target within 10ft of you and miss, you may immediately recover the thrown weapon.",
                        "You gain a swimming speed equal to your walking speed.",
                        "You have advantage on {@skill athletics} and {@skill acrobatics} checks associated with water or ships."
                    ]
                }
            ]
        },
        {
            "name": "Beastmaster",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You know the workings of beasts. You know what drives them and what pleases them. And you know exactly what scares them",
                {
                    "type": "list",
                    "items": [
                        "When using a Whip, your weapon damage die is increased to {@damage d6}.",
                        "You gain proficiency in either the {@skill animal handling} skill or {@skill nature} skill",
                        "You have advantage on checks made to track Beasts.",
                        "When you attack a beast you may use your bonus action to deter it from attacking a target. Designate a target. If the beast fails Wisdom (DC 8 + your proficiency bonus + your Charisma modifier) save, it has disadvantage when attacking the target until the end of your next turn."
                    ]
                }
            ]
        }
    ]
}