{
    "_meta": {
        "sources": [{
            "json": "RBMM",
            "abbreviation": "RBMM",
            "full": "Rici's Book of Magical Magic",
            "authors": [
                "Ricij"
            ],
            "convertedBy": [
                "Gabij"
            ],
            "version": "1.0",
            "url": "www.google.com",
            "targetSchema": "1.0"
        }],
        "dateAdded": 1663497984,
        "dateLastModified": 1663497984
    },
    "feat": [{
            "name": "Aberrant Dragonmark",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                    "source": "UAWGE",
                    "page": 112
                },
                {
                    "source": "ERLW",
                    "page": 52
                }
            ],
            "prerequisite": [{
                "other": "No other dragonmark"
            }],
            "additionalSpells": [{
                "ability": "con",
                "innate": {
                    "_": {
                        "rest": {
                            "1": [{
                                "choose": "level=1|class=Sorcerer"
                            }]
                        }
                    }
                },
                "known": {
                    "_": [{
                        "choose": "level=0|class=Sorcerer"
                    }]
                }
            }],
            "entries": [
                "You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn a {@filter cantrip of your choice from the sorcerer spell list|spells|level=0|class=Sorcerer}. In addition, choose a {@filter 1st-level spell from the sorcerer spell list|spells|level=1|class=Sorcerer}. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.",
                        "When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage."
                    ]
                },
                "You also develop a random flaw from the Aberrant Dragonmark Flaws table.",
                {
                    "type": "table",
                    "caption": "Aberrant Dragonmark Flaws",
                    "colLabels": [
                        "d8",
                        "Flaw"
                    ],
                    "colStyles": [
                        "col-2 text-center",
                        "col-10"
                    ],
                    "rows": [
                        [
                            "1",
                            "Your mark is a source of constant physical pain."
                        ],
                        [
                            "2",
                            "Your mark whispers to you. Its meaning can be unclear."
                        ],
                        [
                            "3",
                            "When you're stressed, the mark hisses audibly."
                        ],
                        [
                            "4",
                            "The skin around the mark is burned, scaly, or withered."
                        ],
                        [
                            "5",
                            "Animals are uneasy around you."
                        ],
                        [
                            "6",
                            "You have a mood swing any time you use your mark."
                        ],
                        [
                            "7",
                            "Your looks change slightly whenever you use the mark."
                        ],
                        [
                            "8",
                            "You have horrific nightmares after you use your mark."
                        ]
                    ]
                }
            ]
        },
        {
            "name": "Actor",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 165
            }],
            "entries": [
                "Skilled at mimicry and dramatics, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on Charisma ({@skill Deception}) and Charisma ({@skill Performance}) checks when trying to pass yourself off as a different person.",
                        "You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom ({@skill Insight}) check contested by your Charisma ({@skill Deception}) check allows a listener to determine that the effect is faked.",
                        "When you hear someone speak, you can, with a successful Wisdom ({@skill Insight}) check..."
                    ]
                }
            ]
        },

        {
            "name": "Artificer Initiate",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "TCE",
                "page": 79
            }],
            "toolProficiencies": [{
                "anyArtisansTool": true
            }],
            "additionalSpells": [{
                "ability": "int",
                "innate": {
                    "_": {
                        "daily": {
                            "1": [{
                                "choose": "level=1|class=Artificer"
                            }]
                        }
                    }
                },
                "known": {
                    "_": [{
                        "choose": "level=0|class=Artificer"
                    }]
                }
            }],
            "entries": [
                "You've learned some of an artificer's inventiveness:",
                {
                    "type": "list",
                    "items": [
                        "You learn one cantrip of your choice from the {@filter artificer spell list|spells|level=0;1|class=artificer}, and you learn one 1st-level spell of your choice from {@filter that list|spells|level=0;1|class=artificer}. Intelligence is your spellcasting ability for these spells.",
                        "You can cast this feat's 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.",
                        "You gain proficiency with one type of {@filter artisan's tools|items|type=artisan's tools} of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability."
                    ]
                }
            ]
        },

        {
            "name": "Tavern Brawler",
            "source": "RBMM",
            "page": 0,
            "otherSources": [{
                "source": "PHB",
                "page": 170
            }],
            "entries": [
                "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You are proficient with improvised weapons.",
                        "Your unarmed strike uses a {@damage d4} for damage.",
                        "Your attacks using improvised weapons use a {@damage d6} for damage.",
                        "You treat improvised weapons as finesse weapons.",
                        "When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target."
                    ]
                }
            ]
        },

        {
            "name": "All Out Attack",
            "source": "RBMM",
            "page": 0,

            "entries": [
                "You fight with reckless abandon, caring little for your own safety. You may die one day – but that day will come sooner to your enemies.",
                {

                    "type": "list",
                    "items": [
                        "At the end of your turn you can enter a stance prepared for striking at anyone who comes near. You can subtract your proficiency bonus from your AC until the start of your next turn. When a creature within your reach hits you with a melee attack, you may use your reaction to make an attack against that creature."
                    ]
                }
            ]
        },

        {
            "name": "Bulwark",
            "source": "RBMM",
            "page": 0,

            "entries": [
                "Standing still, feet on the ground, your defenses become impenetrable.",
                {

                    "type": "list",
                    "items": [
                        "At the start of your turn, you can reduce your speed to 0. If you do so you can use your reaction to impose disadvantage on a melee attack made against you before the start of your next turn.",
                        "When an effect causes you to move without expending your movement, you can reduce the movement by 5ft"
                    ]
                }
            ]
        },

        {
            "name": "Deadly Cunning",
            "source": "RBMM",
            "page": 0,
            "prerequisite": [{
                "other": [{
                    "name": "sneak attack"
                }]
            }],
            "entries": [
                "You are uncommonly nimble for your race. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When casting a cantrip that requires an attack roll and causes damage to a single target, or when you make an unarmed or improvised weapon attack, if you have advantage, you can add your Sneak Attack damage as if you were wielding a finesse or ranged weapon."
                    ]
                }
            ]
        },

        {
            "name": "Demolitionist",
            "source": "RBMM",
            "page": 0,

            "entries": [
                "Destroying something is easy. Demolishing it is art",
                {

                    "type": "list",
                    "items": [
                        "You get advantge when making attacks against an object.",
                        "When making an attack against an object or construct, your attack critically strike on rolls of 19 or 20 and ignore half of the damage resistance the target has.",
                        "You have advantage on saving throws and ability check to avoid falling rubble or collapsing ground."
                    ]
                }
            ]
        },

        {
            "name": "Arena Fighter",
            "source": "RBMM",
            "page": 0,

            "entries": [
                "Some fight to kill, some fight to survive. You fight to put on a show.",
                {

                    "type": "list",
                    "items": [
                        "You gain proficiency with the {@weapon net}, {@weapon trident}, {@weapon flail}, {@weapon morningstar}, {@weapon scimitar}, {@weapon whip}, and{@armor shield}",
                        "When making an attack with the {@weapon net}, you dont have Disadvantage from using the Net's long range.",
                        "When making a ranged attack against a target within 5ft of you, you don't get Disadvantage from attacking with an enemy in melee."
                    ]
                }
            ]
        },

        {
            "name": "Man of the Sea",
            "source": "RBMM",
            "page": 0,

            "entries": [
                "You find life at sea a second nature.",
                {

                    "type": "list",
                    "items": [
                        "You gain proficiency with the {@weapon net} and {@weapon trident}",
                        "When you make a ranged attack with the {@weapon net} or {@weapon trident} against a target within 10ft of you and miss, you may immediately recover the thrown weapon.",
                        "You gain a swimming speed equal to your walking speed.",
                        "You have advantage on {@skill athletics} and {@skill acrobatics} checks associated with water or ships."
                    ]
                }
            ]
        },

        {
            "name": "Beastmaster",
            "source": "RBMM",
            "page": 0,
            "entries": [
                "You know the workings of beasts. You know what drives them and what pleases them. And you know exactly what scares them",
                {
                    "type": "list",
                    "items": [
                        "When using a Whip, your weapon damage die is increased to {@damage d6}.",
                        "You gain proficiency in either the {@skill animal handling} skill or {@skill nature} skill",
                        "You have advantage on checks made to track Beasts.",
                        "When you attack a beast you may use your bonus action to deter it from attacking a target. Designate a target. If the beast fails Wisdom (DC 8 + your proficiency bonus + your Charisma modifier) save, it has disadvantage when attacking the target until the end of your next turn."
                    ]
                }
            ]
        }

    ]
}